cmsis-svd/cmsis-svd/data/Microchip/ATSAMV71QxB.svd
            <register>
               <dim>10</dim>
               <dimIncrement>4</dimIncrement>
               <name>USBHS_DEVEPTIER_ISO_MODE[%s]</name>
               <description>Device Endpoint Interrupt Enable Register</description>
               <alternateRegister>USBHS_DEVEPTIER_CTRL_MODE[%s]</alternateRegister>
               <addressOffset>0x1F0</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>TXINES</name>
                     <description>Transmitted IN Data Interrupt Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXOUTES</name>
                     <description>Received OUT Data Interrupt Enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>UNDERFES</name>
                     <description>Underflow Interrupt Enable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>HBISOINERRES</name>
                     <description>High Bandwidth Isochronous IN Underflow Error Interrupt Enable</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>HBISOFLUSHES</name>
                     <description>High Bandwidth Isochronous IN Flush Interrupt Enable</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OVERFES</name>
                     <description>Overflow Interrupt Enable</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CRCERRES</name>
                     <description>CRC Error Interrupt Enable</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SHORTPACKETES</name>
                     <description>Short Packet Interrupt Enable</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MDATAES</name>
                     <description>MData Interrupt Enable</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DATAXES</name>
                     <description>DataX Interrupt Enable</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ERRORTRANSES</name>
                     <description>Transaction Error Interrupt Enable</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NBUSYBKES</name>
                     <description>Number of Busy Banks Interrupt Enable</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>KILLBKS</name>
                     <description>Kill IN Bank</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FIFOCONS</name>
                     <description>FIFO Control</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EPDISHDMAS</name>
                     <description>Endpoint Interrupts Disable HDMA Request Enable</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RSTDTS</name>
                     <description>Reset Data Toggle Enable</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>10</dim>
               <dimIncrement>4</dimIncrement>
               <name>USBHS_DEVEPTIER_BLK_MODE[%s]</name>
               <description>Device Endpoint Interrupt Enable Register</description>
               <alternateRegister>USBHS_DEVEPTIER_CTRL_MODE[%s]</alternateRegister>
               <addressOffset>0x1F0</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>TXINES</name>
                     <description>Transmitted IN Data Interrupt Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXOUTES</name>
                     <description>Received OUT Data Interrupt Enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXSTPES</name>
                     <description>Received SETUP Interrupt Enable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NAKOUTES</name>
                     <description>NAKed OUT Interrupt Enable</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NAKINES</name>
                     <description>NAKed IN Interrupt Enable</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OVERFES</name>
                     <description>Overflow Interrupt Enable</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>STALLEDES</name>
                     <description>STALLed Interrupt Enable</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SHORTPACKETES</name>
                     <description>Short Packet Interrupt Enable</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NBUSYBKES</name>
                     <description>Number of Busy Banks Interrupt Enable</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>KILLBKS</name>
                     <description>Kill IN Bank</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FIFOCONS</name>
                     <description>FIFO Control</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EPDISHDMAS</name>
                     <description>Endpoint Interrupts Disable HDMA Request Enable</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NYETDISS</name>
                     <description>NYET Token Disable Enable</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RSTDTS</name>
                     <description>Reset Data Toggle Enable</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>STALLRQS</name>
                     <description>STALL Request Enable</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>10</dim>
               <dimIncrement>4</dimIncrement>
               <name>USBHS_DEVEPTIER_INTRPT_MODE[%s]</name>
               <description>Device Endpoint Interrupt Enable Register</description>
               <alternateRegister>USBHS_DEVEPTIER_CTRL_MODE[%s]</alternateRegister>
               <addressOffset>0x1F0</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>TXINES</name>
                     <description>Transmitted IN Data Interrupt Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXOUTES</name>
                     <description>Received OUT Data Interrupt Enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXSTPES</name>
                     <description>Received SETUP Interrupt Enable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NAKOUTES</name>
                     <description>NAKed OUT Interrupt Enable</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NAKINES</name>
                     <description>NAKed IN Interrupt Enable</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OVERFES</name>
                     <description>Overflow Interrupt Enable</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>STALLEDES</name>
                     <description>STALLed Interrupt Enable</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SHORTPACKETES</name>
                     <description>Short Packet Interrupt Enable</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NBUSYBKES</name>
                     <description>Number of Busy Banks Interrupt Enable</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>KILLBKS</name>
                     <description>Kill IN Bank</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FIFOCONS</name>
                     <description>FIFO Control</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EPDISHDMAS</name>
                     <description>Endpoint Interrupts Disable HDMA Request Enable</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NYETDISS</name>
                     <description>NYET Token Disable Enable</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RSTDTS</name>
                     <description>Reset Data Toggle Enable</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>STALLRQS</name>
                     <description>STALL Request Enable</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>10</dim>
               <dimIncrement>4</dimIncrement>
               <name>USBHS_DEVEPTIDR_CTRL_MODE[%s]</name>
               <description>Device Endpoint Interrupt Disable Register</description>
               <addressOffset>0x220</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>TXINEC</name>
                     <description>Transmitted IN Interrupt Clear</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXOUTEC</name>
                     <description>Received OUT Data Interrupt Clear</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXSTPEC</name>
                     <description>Received SETUP Interrupt Clear</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NAKOUTEC</name>
                     <description>NAKed OUT Interrupt Clear</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NAKINEC</name>
                     <description>NAKed IN Interrupt Clear</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OVERFEC</name>
                     <description>Overflow Interrupt Clear</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>STALLEDEC</name>
                     <description>STALLed Interrupt Clear</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SHORTPACKETEC</name>
                     <description>Shortpacket Interrupt Clear</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NBUSYBKEC</name>
                     <description>Number of Busy Banks Interrupt Clear</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FIFOCONC</name>
                     <description>FIFO Control Clear</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EPDISHDMAC</name>
                     <description>Endpoint Interrupts Disable HDMA Request Clear</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NYETDISC</name>
                     <description>NYET Token Disable Clear</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>STALLRQC</name>
                     <description>STALL Request Clear</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>10</dim>
               <dimIncrement>4</dimIncrement>
               <name>USBHS_DEVEPTIDR_ISO_MODE[%s]</name>
               <description>Device Endpoint Interrupt Disable Register</description>
               <alternateRegister>USBHS_DEVEPTIDR_CTRL_MODE[%s]</alternateRegister>
               <addressOffset>0x220</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>TXINEC</name>
                     <description>Transmitted IN Interrupt Clear</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXOUTEC</name>
                     <description>Received OUT Data Interrupt Clear</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>UNDERFEC</name>
                     <description>Underflow Interrupt Clear</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>HBISOINERREC</name>
                     <description>High Bandwidth Isochronous IN Underflow Error Interrupt Clear</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>HBISOFLUSHEC</name>
                     <description>High Bandwidth Isochronous IN Flush Interrupt Clear</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OVERFEC</name>
                     <description>Overflow Interrupt Clear</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SHORTPACKETEC</name>
                     <description>Shortpacket Interrupt Clear</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MDATAEC</name>
                     <description>MData Interrupt Clear</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DATAXEC</name>
                     <description>DataX Interrupt Clear</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ERRORTRANSEC</name>
                     <description>Transaction Error Interrupt Clear</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NBUSYBKEC</name>
                     <description>Number of Busy Banks Interrupt Clear</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FIFOCONC</name>
                     <description>FIFO Control Clear</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EPDISHDMAC</name>
                     <description>Endpoint Interrupts Disable HDMA Request Clear</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
